In [1]:
import numpy as np
import pandas as pd

In [3]:
series1 = pd.Series([21, 33, 54])

series1

0    21
1    33
2    54
dtype: int64

In [5]:
s = pd.Series([89.2, 76.4, 98.2, 75.9], index=list("abcd"))

print(s[["c", "a"]])

c    98.2
a    89.2
dtype: float64

In [38]:
dat = {
    "col1": ["A", "A", "B", np.NaN, "D", "C"],
    "col2": [2, 1, 9, 8, 7, 4],
    "col3": [0, 1, 9, 4, 2, 3],
}

df = pd.DataFrame(dat)

In [40]:
df

  col1  col2  col3
0    A     2     0
1    A     1     1
2    B     9     9
3  NaN     8     4
4    D     7     2
5    C     4     3

In [29]:
df.sort_values(by="col1", ascending=False, na_position="first")

  col1  col2  col3
3  NaN     8     4
4    D     7     2
5    C     4     3
2    B     9     9
0    A     2     0
1    A     1     1

In [6]:
s = pd.Series(np.random.randn(4))

print(s.ndim)

1

In [7]:
df = pd.DataFrame(
    {
        "Car": ["Bmw", "Audi", "Porsche", "Mercedes"],
        "Fuel Type": ["Petrol", "Diesel", "Petrol", "Diesel"],
        "Year": [2017, 2001, 1999, 2021],
    }
)

x = list(df.iloc[0, 1:2])

print(x)

['Petrol']

In [8]:
S1 = pd.Series(data=2 * (31, 2, -6))

print(S1)

0    31
1     2
2    -6
3    31
4     2
5    -6
dtype: int64

In [34]:
df = pd.DataFrame(np.arange(25).reshape(5, -1))
df.iloc[::-1, :]

    0   1   2   3   4
4  20  21  22  23  24
3  15  16  17  18  19
2  10  11  12  13  14
1   5   6   7   8   9
0   0   1   2   3   4

In [21]:
dat = {"Roll": [1, 2, 3, 4, 5, 6, 7, 8, 9, 0, 1]}

df = pd.DataFrame(dat)

In [12]:
df

    Roll
0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9      0
10     1

In [ ]:
df.iloc[:5]

0

In [22]:
df.loc[[0, 1]]

   Roll
0     1
1     2

In [32]:
print(np.arange(25).reshape(5, -1))

[[ 0  1  2  3  4]
 [ 5  6  7  8  9]
 [10 11 12 13 14]
 [15 16 17 18 19]
 [20 21 22 23 24]]